[
    {
      "role": "Robotic Software Engineer",
      "organisation": "ROVULA (THAILAND) CO., LTD",
      "startDate": "April, 2023",
      "endDate": "Present",
      "experiences": ["Implemented Docker containerization for wrapping ROS2 packages, significantly reducing deployment time and streamlining testing and production processes.",
      "Extended the functionality of the React and TypeScript-based robot web UI by integrating new features, enhancing user experience and capabilities.",
      "Utilized MQTT protocol to establish seamless data transmission between the AWS cloud infrastructure and the local robot, enhancing communication efficiency and data exchange reliability."
    ],
      "tags": ["Python", "TypeScript", "ONNX", "TensorRT", "Azure", "Docker", "Kubernetes"],
      "imageSrc": "experiences/rov.png"
    },
    {
      "role": "AI & Backend Engineer",
      "organisation": "Dynamic Intelligence Asia",
      "startDate": "October, 2023",
      "endDate": "March, 2023",
      "experiences": ["Optimized human detection performance for operator monitoring software by converting the model to ONNX and using ONNX-Runtime for inferencing with TensorRT.",
      "Created a backup and retention service using Python scheduling and TypeScript for CRUD operations, that regularly backed up record data from databases as CSV files in blob storage."],
      "tags": ["Python", "TypeScript", "ONNX", "TensorRT", "Azure", "Docker", "Kubernetes"],
      "imageSrc": "experiences/dia.png"
    },
    {
      "role": "Computer Vision Intern",
      "organisation": "RUTILEA Co., Ltd",
      "startDate": "March, 2022",
      "endDate": "August, 2022",
      "experiences": [
        "Developed OCR software for checking the order of the connecting-rod by preprocessing the image to be readable and classifying the engraved text with machine learning model (SVM).",
        "pplied the Structure from Motion algorithm and Multi-view stereo (openMVG & openMVS) to reconstruct apoint cloud of a drilled hydraulic valve for burr detection."
      ],
      "tags": ["Python", "OpenCV", "SVM", "openMVG", "openMVS"],
      "imageSrc": "experiences/rutilea.png"
    }
  ]