[
    {
      "role": "Robotic Software Engineer",
      "organisation": "ROVULA (THAILAND) CO., LTD",
      "startDate": "April, 2023",
      "endDate": "Present",
      "experiences": ["Developed software solutions for underwater pipeline inspection robots, focusing on robotic perception, containerized ROS2 applications and web-based control interfaces.",
      "Integrated ML-based detection pipelines, including point cloud processing for object tracking and an autonomous docking system using sonar image processing.",
      "Implemented Docker containerization for wrapping ROS2 packages, significantly reducing deployment time and integration testing and production processes.",
      "Built a Web UI with React Leaflet to create and manage waypoints on a map, persisting data in MongoDB, and used WebSocket to visualize the robot's position in real time."
    ],
      "tags": ["Docker", "React", "MongoDB", "OpenCV", "Pytorch", "Python", "C++"],
      "imageSrc": "experiences/rov.png"
    },
    {
      "role": "AI & Backend Engineer",
      "organisation": "Dynamic Intelligence Asia",
      "startDate": "October, 2023",
      "endDate": "March, 2023",
      "experiences": ["Worked on AI-powered monitoring systems, optimizing human detection models and implementing backend services for data processing.",
      "Optimized human detection performance for operator monitoring software by converting the model to ONNX and using ONNX-Runtime for inferencing with TensorRT.",
      "Created a backup and retention service using Python scheduling and TypeScript for CRUD operations, that regularly backed up record data from databases as CSV files in blob storage."],
      "tags": ["Docker", "FastAPI",  "NestJS", "OpenCV", "Pytorch", "Python", "TypeScript"],
      "imageSrc": "experiences/dia.png"
    },
    {
      "role": "Computer Vision Intern",
      "organisation": "RUTILEA Co., Ltd",
      "startDate": "March, 2022",
      "endDate": "August, 2022",
      "experiences": [
        "Developed OCR software for checking the order of the connecting-rod by preprocessing the image to be readable and classifying the engraved text with machine learning model (SVM).",
        "pplied the Structure from Motion algorithm and Multi-view stereo (openMVG & openMVS) to reconstruct apoint cloud of a drilled hydraulic valve for burr detection."
      ],
      "tags": ["Python", "OpenCV", "SVM", "openMVG", "openMVS"],
      "imageSrc": "experiences/rutilea.png"
    }
  ]